app/controllers/api/v1/abductions_controller.rb

	def index
		abductions = Abduction.order(created_at: :desc)
---
SELECT "abductions".* FROM "abductions" ORDER BY "abductions"."created_at" DESC

	def create

		abduction = Abduction.new(abduction_params)

		if abduction.save

			#flagging survivor as abducted when at least three other survivors report their abduction
			survivor = Survivor.find(abduction.survivor.id)
			abductions = Abduction.where(survivor_id: survivor.id)

			if abductions.count >= 3
				survivor.update(abducted: true)
---
INSERT INTO "abductions" ("survivor_id", "abducted", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["survivor_id", 10], ["abducted", true], ["created_at", "2019-05-05 00:32:09.357820"], ["updated_at", "2019-05-05 00:32:09.357820"]]
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "abductions" WHERE "abductions"."survivor_id" = $1  [["survivor_id", 10]]
UPDATE "survivors" SET "abducted" = $1, "updated_at" = $2 WHERE "survivors"."id" = $3  [["abducted", true], ["updated_at", "2019-05-05 01:25:09.966174"], ["id", 10]]

	def update
		abduction = Abduction.find(params[:id])
---
SELECT  "abductions".* FROM "abductions" WHERE "abductions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def destroy

		abduction = Abduction.find(params[:id])

		abduction.destroy
---
SELECT  "abductions".* FROM "abductions" WHERE "abductions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "abductions" WHERE "abductions"."id" = $1  [["id", 1]]