app/controllers/api/v1/survivors_controller.rb

	def update
		@survivor = Survivor.find(params[:id])

		if @survivor.update(survivor_params)
---
UPDATE "survivors" SET "name" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "survivors"."id" = $5  [["name", "Anne"], ["latitude", "40.0677174866262"], ["longitude", "-111.602125919385"], ["updated_at", "2019-05-02 19:13:55.185888"], ["id", 9]]

	def destroy

		@survivor = Survivor.find(params[:id])

		@survivor.destroy
---
DELETE FROM "survivors" WHERE "survivors"."id" = $1  [["id", 3]]