app/controllers/api/v1/survivors_controller.rb

	def index

		survivor = Survivor.all

		#Percentage of abducted survivors
		abducted_survivors = Survivor.where(abducted: true)
		abductions = "#{(abducted_survivors.count.to_f / survivor.count) * 100}%"

		#Percentage of non-abducted survivors
		non_abducted_survivors = Survivor.where(abducted: false)
		non_abductions =  "#{(non_abducted_survivors.count.to_f / survivor.count) * 100}%"

		#Listing all survivors names, by alphabetic order, with an identification to know who was abducted
		survivors = Survivor.select(:id, :name, :abducted).order(:name)
---
SELECT "survivors".* FROM "survivors" ORDER BY "survivors"."created_at" DESC
SELECT COUNT(*) FROM "survivors" WHERE "survivors"."abducted" = $1  [["abducted", true]]
SELECT COUNT(*) FROM "survivors" WHERE "survivors"."abducted" = $1  [["abducted", false]]
SELECT "survivors"."id", "survivors"."name", "survivors"."abducted" FROM "survivors" ORDER BY "survivors"."name" ASC

	def show
		survivor = Survivor.find(params[:id])
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

	def create

		survivor = Survivor.new(survivor_params)

		if survivor.save
---
INSERT INTO "survivors" ("name", "gender", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def update
		survivor = Survivor.find(params[:id])

		if survivor.update(survivor_params)
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "survivors" SET "gender" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "survivors"."id" = $5  [["gender", "female"], ["latitude", "40.927955"], ["longitude", "-112.605812600303"], ["updated_at", "2019-05-05 01:17:51.137630"], ["id", 10]]

	def destroy

		survivor = Survivor.find(params[:id])

		survivor.destroy
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "survivors" WHERE "survivors"."id" = $1  [["id", 5]]